Saud_Almotairy/week_06/day_01/SaudPhotosLiberary/app/controllers/albums_controller.rb

  def show
    @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    album = Album.create(@album)
---
INSERT INTO "albums" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-11-05 21:08:01.147605"], ["updated_at", "2018-11-05 21:08:01.147605"]]