Saud_Almotairy/week_05/day_02/straight_curdin/app/controllers/cheeses_controller.rb

  def index
    @cheeses = Cheese.all
---
SELECT "cheeses".* FROM "cheeses"

  def show
    @cheese = Cheese.find(params[:id])
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @cheese = Cheese.find(params[:id])
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    cheese = Cheese.create(cheese_params)
---
INSERT INTO "cheeses" ("name", "milk_type", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    cheese = Cheese.find_by(id: params[:id])
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    cheese = Cheese.find_by(id: params[:id])
    cheese.destroy
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cheeses" WHERE "cheeses"."id" = ?  [["id", 1]]