Saud_Almotairy/week_05/day_03/straight_curdin/app/controllers/cheeses_controller.rb

SELECT "cheeses".* FROM "cheeses"
---
  def index
    @cheeses = Cheese.all

SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cheese = Cheese.find(params[:id])

SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @cheese = Cheese.find(params[:id])

INSERT INTO "cheeses" ("name", "milk_type", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    cheese = Cheese.create(cheese_params)